---
kind: other
id: Operators.T:Autodesk.Revit.DB.ExternalGeometryId
source: html/f0b889a0-c160-2fd0-71d1-405fd946e926.htm
---
# ExternalGeometryId Operators

Determines whether two ExternalGeometryIds are the same.